eastww/ai-watch/sdkconfig.defaults
# ==== Target ====
CONFIG_IDF_TARGET="esp32s3"

# ==== Flash: 16MB on board ====
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ==== PSRAM: ESP32-S3R8 has 8MB octal PSRAM ====
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# ==== Partition table ====
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ==== Log level ====
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ==== LVGL (managed via esp_lv_adapter) ====
CONFIG_LV_USE_PERF_MONITOR=y

# ==== NVS for WiFi / API keys ====
CONFIG_NVS_ENCRYPTION=n

# ==== SNTP (system time for ASR auth signature) ====
CONFIG_LWIP_SNTP=y
CONFIG_LWIP_SNTP_UPDATE_DELAY=60000
CONFIG_LWIP_TIMEZONE_ID=y

# ==== mbedTLS memory optimization (TLS handshake buffers on PSRAM) ====
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_LWIP_SNTP_MAX_SERVERS=1